RotationalTank_GIT/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale    1;

vertices
(
    //overset_patch_tank
(-0.5 0.5 -0.5) //0
(-0.5 -0.5 -0.5) //1
(0.5 -0.5 -0.5) //2
(0.5 0.5 -0.5) //3

(-0.5 0.5 0.5) //4
(-0.5 -0.5 0.5) //5
(0.5 -0.5 0.5) //6
(0.5 0.5 0.5) //7

//moving_walls

    //-0.17 0.17 -0.3) //8
    //(-0.17 -0.17 -0.3) //9
    //(0.17 -0.17 -0.3) //10
    //(0.17 0.17 -0.3) //11

    //(-0.21 0.21 0.3) //12
    //(-0.21 -0.21 0.3) //13
    //(0.21 -0.21 0.3) //14
    //(0.21 0.21 0.3) //15

//overset_patch_tank
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ( 20 20 20 ) simpleGrading ( 1 1 1 )//For the overset patch of the tank
    //hex (8 9 10 11 12 13 14 15) movingZone ( 32 32 75 )//For the actual tank
    //simpleGrading
    //(
        //(
            //(0.3648648648648649 0.3125 0.4)
            //(0.2702702702702703 0.375 1)
            //(0.3648648648648649 0.3125 2.5)
        //)
        //(
            //(0.3648648648648649 0.3125 0.4)
            //(0.2702702702702703 0.375 1)
            //(0.3648648648648649 0.3125 2.5)
    //     //)
    //     1
    // )
);
edges
(
);

boundary
(
    comp_domain
    {
        type wall;
        faces
        (
        (0 1 5 4)
	    (0 1 2 3)
	    (3 2 6 7)
	    (0 4 7 3)
        (1 2 5 6)
        //(4 5 6 7)
        );
    }
//movingWalls
//{
    //type wall;
//     faces
//     (
//     (8 9 13 12)
//     (8 9 10 11)
//     (11 10 14 15)
//     (8 12 15 11)
//     (9 10 13 14)
//     );
// }
movingWalls
{
type wall;
faces ();
}

 comp_domain_atmosphere
{
     type patch;
     faces
     (
         (4 5 6 7)
     );
}

);


// ************************************************************************* //
