RotationalTank_GIT/constant/dynamicMeshDict.meshmorphing
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh;


        motionSolverLibs    (librigidBodyMeshMotion);
        motionSolver         rigidBodyMotion;

        report              on;
        solver
        {
            type Newmark;
        }

        accelerationRelaxation 0.6;
        accelerationDamping    1.0;
        nIter   12;

        bodies
        {
            movingWalls
            {
                type            rigidBody;
                parent          root;
                mass            15000;

                centreOfMass     (0 0 0);
                inertia         (564 0 0 8535 0 8535);
                transform       (1 0 0 0 1 0 0 0 1)  (0 0 0);
                joint
                {
                    type            composite;

                    joints
                    (
                        {
                            type Pxyz;
                       	}
                    );
                }
                patches         (movingWalls);
                innerDistance   0.15;
                outerDistance   0.3;
            }
        
           
        }
restraints
        {
           force
            {
                type        externalForce;
                body        movingWalls;
                location    (0 0 0);
                force       table
                (
                    (0.0000    (0.0000 0.00 208953.3333))
                    (0.0050    (2793.9939 0.00 208889.9920))
                    (0.0100    (5582.2468 0.00 208700.0980))
                    (0.0150    (8359.0295 0.00 208384.0416))
                    (0.0200    (11118.6365 0.00 207942.4722))
                    (0.0250    (13855.3973 0.00 207376.2971))
                    (0.0300    (16563.6886 0.00 206686.6797))
                    (0.0350    (19237.9455 0.00 205875.0370))
                    (0.0400    (21872.6731 0.00 204943.0367))
                    (0.0450    (24462.4576 0.00 203892.5939))
                    (0.0500    (27001.9776 0.00 202725.8668))
                    (0.0550    (29486.0151 0.00 201445.2530))
                    (0.0600    (31909.4659 0.00 200053.3837))
                    (0.0650    (34267.3505 0.00 198553.1190))
                    (0.0700    (36554.8239 0.00 196947.5414))
                    (0.0750    (38767.1859 0.00 195239.9500))
                    (0.0800    (40899.8907 0.00 193433.8536))
                    (0.0850    (42948.5561 0.00 191532.9633))
                    (0.0900    (44908.9725 0.00 189541.1848))
                    (0.0950    (46777.1119 0.00 187462.6109))
                    (0.1000    (48549.1355 0.00 185301.5125))
                    (0.1050    (50221.4023 0.00 183062.3302))
                    (0.1100    (51790.4763 0.00 180749.6649))
                    (0.1150    (53253.1333 0.00 178368.2685))
                    (0.1200    (54606.3679 0.00 175923.0344))
                    (0.1250    (55847.3996 0.00 173418.9868))
                    (0.1300    (56973.6783 0.00 170861.2710))
                    (0.1350    (57982.8899 0.00 168255.1424))
                    (0.1400    (58872.9605 0.00 165605.9561))
                    (0.1450    (59642.0614 0.00 162919.1555))
                    (0.1500    (60288.6123 0.00 160200.2612))
                    (0.1550    (60811.2846 0.00 157454.8600))
                    (0.1600    (61209.0043 0.00 154688.5930))
                    (0.1650    (61480.9542 0.00 151907.1443))
                    (0.1700    (61626.5756 0.00 149116.2290))
                    (0.1750    (61645.5693 0.00 146321.5817))
                    (0.1800    (61537.8961 0.00 143528.9449))
                    (0.1850    (61303.7774 0.00 140744.0567))
                    (0.1900    (60943.6941 0.00 137972.6393))
                    (0.1950    (60458.3863 0.00 135220.3875))
                    (0.2000    (59848.8510 0.00 132492.9563))
                    (0.2050    (59116.3408 0.00 129795.9501))
                    (0.2100    (58262.3607 0.00 127134.9104))
                    (0.2150    (57288.6655 0.00 124515.3052))
                    (0.2200    (56197.2559 0.00 121942.5170))
                    (0.2250    (54990.3744 0.00 119421.8324))
                    (0.2300    (53670.5010 0.00 116958.4306))
                    (0.2350    (52240.3476 0.00 114557.3735))
                    (0.2400    (50702.8529 0.00 112223.5946))
                    (0.2450    (49061.1761 0.00 109961.8892))
                    (0.2500    (47318.6903 0.00 107776.9047))
                    (0.2550    (45478.9760 0.00 105673.1307))
                    (0.2600    (43545.8134 0.00 103654.8898))
                    (0.2650    (41523.1746 0.00 101726.3291))
                    (0.2700    (39415.2157 0.00 99891.4113))
                    (0.2750    (37226.2680 0.00 98153.9068))
                    (0.2800    (34960.8293 0.00 96517.3856))
                    (0.2850    (32623.5546 0.00 94985.2105))
                    (0.2900    (30219.2462 0.00 93560.5297))
                    (0.2950    (27752.8446 0.00 92246.2705))
                    (0.3000    (25229.4176 0.00 91045.1336))
                    (0.3050    (22654.1502 0.00 89959.5868))
                    (0.3100    (20032.3340 0.00 88991.8607))
                    (0.3150    (17369.3562 0.00 88143.9439))
                    (0.3200    (14670.6885 0.00 87417.5785))
                    (0.3250    (11941.8761 0.00 86814.2570))
                    (0.3300    (9188.5260 0.00 86335.2192))
                    (0.3350    (6416.2957 0.00 85981.4493))
                    (0.3400    (3630.8814 0.00 85753.6743))
                    (0.3450    (838.0066 0.00 85652.3621))
                    (0.3500    (-1956.5901 0.00 85677.7210))
                    (0.3550    (-4747.1665 0.00 85829.6989))
                    (0.3600    (-7527.9887 0.00 86107.9834))
                    (0.3650    (-10293.3426 0.00 86512.0028))
                    (0.3700    (-13037.5462 0.00 87040.9268))
                    (0.3750    (-15754.9607 0.00 87693.6688))
                    (0.3800    (-18440.0027 0.00 88468.8874))
                    (0.3850    (-21087.1548 0.00 89364.9897))
                    (0.3900    (-23690.9779 0.00 90380.1346))
                    (0.3950    (-26246.1218 0.00 91512.2361))
                    (0.4000    (-28747.3362 0.00 92758.9680))
                    (0.4050    (-31189.4818 0.00 94117.7686))
                    (0.4100    (-33567.5405 0.00 95585.8459))
                    (0.4150    (-35876.6259 0.00 97160.1833))
                    (0.4200    (-38111.9936 0.00 98837.5459))
                    (0.4250    (-40269.0503 0.00 100614.4872))
                    (0.4300    (-42343.3637 0.00 102487.3560))
                    (0.4350    (-44330.6718 0.00 104452.3040))
                    (0.4400    (-46226.8910 0.00 106505.2937))
                    (0.4450    (-48028.1251 0.00 108642.1067))
                    (0.4500    (-49730.6729 0.00 110858.3524))
                    (0.4550    (-51331.0362 0.00 113149.4768))
                    (0.4600    (-52825.9266 0.00 115510.7724))
                    (0.4650    (-54212.2724 0.00 117937.3872))
                    (0.4700    (-55487.2251 0.00 120424.3350))
                    (0.4750    (-56648.1648 0.00 122966.5059))
                    (0.4800    (-57692.7063 0.00 125558.6763))
                    (0.4850    (-58618.7031 0.00 128195.5198))
                    (0.4900    (-59424.2526 0.00 130871.6185))
...
                );



            }
            }



// ************************************************************************* //




// ************************************************************************* //
