RotationalTank_GIT/constant/output.txt
50
(
(0.00000 ((0.000000 0 0.050000) (0 0 0)))
(0.04082 ((0.020956 0 0.045397) (0 0 0)))
(0.08163 ((0.038053 0 0.032434) (0 0 0)))
(0.12245 ((0.048143 0 0.013499) (0 0 0)))
(0.16327 ((0.049369 0 -0.007921) (0 0 0)))
(0.20408 ((0.041503 0 -0.027883) (0 0 0)))
(0.24490 ((0.025996 0 -0.042711) (0 0 0)))
(0.28571 ((0.005702 0 -0.049674) (0 0 0)))
(0.32653 ((-0.015642 0 -0.047490) (0 0 0)))
(0.36735 ((-0.034106 0 -0.036562) (0 0 0)))
(0.40816 ((-0.046290 0 -0.018901) (0 0 0)))
(0.44898 ((-0.049950 0 0.002240) (0 0 0)))
(0.48980 ((-0.044412 0 0.022969) (0 0 0)))
(0.53061 ((-0.030697 0 0.039468) (0 0 0)))
(0.57143 ((-0.011329 0 0.048700) (0 0 0)))
(0.61224 ((0.010125 0 0.048964) (0 0 0)))
(0.65306 ((0.029715 0 0.040212) (0 0 0)))
(0.69388 ((0.043833 0 0.024056) (0 0 0)))
(0.73469 ((0.049879 0 0.003471) (0 0 0)))
(0.77551 ((0.046742 0 -0.017754) (0 0 0)))
(0.81633 ((0.034997 0 -0.035710) (0 0 0)))
(0.85714 ((0.016808 0 -0.047090) (0 0 0)))
(0.89796 ((-0.004476 0 -0.049799) (0 0 0)))
(0.93878 ((-0.024935 0 -0.043339) (0 0 0)))
(0.97959 ((-0.040803 0 -0.028898) (0 0 0)))
(1.02041 ((-0.049158 0 -0.009136) (0 0 0)))
(1.06122 ((-0.048461 0 0.012308) (0 0 0)))
(1.10204 ((-0.038841 0 0.031486) (0 0 0)))
(1.14286 ((-0.022068 0 0.044866) (0 0 0)))
(1.18367 ((-0.001232 0 0.049985) (0 0 0)))
(1.22449 ((0.019831 0 0.045899) (0 0 0)))
(1.26531 ((0.037242 0 0.033362) (0 0 0)))
(1.30612 ((0.047796 0 0.014682) (0 0 0)))
(1.34694 ((0.049549 0 -0.006702) (0 0 0)))
(1.38776 ((0.042178 0 -0.026852) (0 0 0)))
(1.42857 ((0.027041 0 -0.042057) (0 0 0)))
(1.46939 ((0.006924 0 -0.049518) (0 0 0)))
(1.51020 ((-0.014467 0 -0.047861) (0 0 0)))
(1.55102 ((-0.033195 0 -0.037391) (0 0 0)))
(1.59184 ((-0.045810 0 -0.020036) (0 0 0)))
(1.63265 ((-0.049990 0 0.001008) (0 0 0)))
(1.67347 ((-0.044965 0 0.021867) (0 0 0)))
(1.71429 ((-0.031660 0 0.038699) (0 0 0)))
(1.75510 ((-0.012526 0 0.048406) (0 0 0)))
(1.79592 ((0.008915 0 0.049199) (0 0 0)))
(1.83673 ((0.028714 0 0.040933) (0 0 0)))
(1.87755 ((0.043226 0 0.025129) (0 0 0)))
(1.91837 ((0.049779 0 0.004699) (0 0 0)))
(1.95918 ((0.047165 0 -0.016597) (0 0 0)))
(2.00000 ((0.035867 0 -0.034837) (0 0 0)))
)
