RotationalTank_GIT/0.orig/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"


    movingWalls
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

floatingObject
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }


 comp_domain
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    comp_domain_atmosphere
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }
	
}


// ************************************************************************* //
