RotationalTank_GIT/0.orig/0.orig/0.orig/alpha.water.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"



    //movingWalls_atmosphere
    //{
        //type            inletOutlet;
        //inletValue      $internalField;
        //value           $internalField;
    //}
 comp_domain_atmosphere
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    movingWalls
    {
        type            zeroGradient;
    }
floatingObject
    {
        type            zeroGradient;
    }
 comp_domain
    {
        type            zeroGradient;
    }

  Absorption_zone´

  {
       type            zeroGradient;
  }
}


// ************************************************************************* //
