RotationalTank_GIT/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(U) cellMDLimited Gauss linear 0.5;
    grad(alpha.water) cellLimited Gauss linear 1;
}

divSchemes
{
   div(rhoPhi,U) Gauss limitedLinearV 0.5;
    div(phi,alpha)  Gauss interfaceCompression vanLeer 1;
    div(phirb,alpha) Gauss vanLeer;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div((rhoPhi|interpolate(porosity)),U) Gauss linear;
}

laplacianSchemes
{
    default Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
     default         limited 1;
}


// ************************************************************************* //
