RotationalTank_GIT/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.water.*"
    {
        nAlphaCorr      2;
        nAlphaSubCycles 3;
        cAlpha         1.5;

        MULESCorr       yes;
        nLimiterIter    4;

        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-8;
        relTol          0;
    }

    pcorr
    {
        solver          GAMG;
        smoother  DIC;
        tolerance       1e-5;
        relTol          0;
        maxIter         100;
    }

    pcorrFinal
    {
        solver          GAMG;
        smoother  DIC;
        tolerance       1e-7;
        relTol          0;
        maxIter         100;
    }




    p_rgh
    {
        solver          GAMG;
        smoother        DIC;
        tolerance       1e-05;
        relTol          0.01;
    }

    p_rghFinal
    {	solver GAMG;
        smoother DIC; 
	tolerance       1e-07;
        relTol          0;
        maxIter         20;
    }

    U
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-05;
        relTol          0;
        nSweeps         1;
    }

   UFinal
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0;
        nSweeps         1;
    }

}

PIMPLE
{
    momentumPredictor yes;
   nOuterCorrectors 3;
    nCorrectors     3;
moveMeshOuterCorrectors yes;

    nNonOrthogonalCorrectors 2;
    // correctPhi      yes;
    pRefPoint       (0 0 0.6);
    //Changed to a higher point that the free surface
    pRefValue       1e5;
}

relaxationFactors
{
  fields
    {
        ".*" 0.9;
    }
    equations
    {
        ".*" 0.9;
    }
}


// ************************************************************************* //
