RotationalTank_GIT/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(


    
    {
    // Mandatory (inherited) entries
    name        waterline;
    type        cellSet;
    action      new;

    source      cylinderToCell;
    // Option-2 
    p1          (0 0 -0.08);
    p2          (0 0 0.08);
    radius      0.45;
    }

);
   



// ************************************************************************* //
